Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Valentine's Day has come to the Dominion!
pt_pt: O Dia dos Namorados chegou ao Domínio!

source: On December 19th, Winter Holidays come to Dominion!
pt_pt: As férias de natal vão chegar a Dominion a 19 de dezembro!

source: The greatest fuzzballs of Dominion need your help!
pt_pt: Estas bolas de pelo precisam da tua ajuda!

source: Win glory!
pt_pt: Conquista a glória!

source: Spring Festival
pt_pt: Festa de Primavera

source: WELCOME TO THE DOMINION!
pt_pt: DESCOBRE O DOMÍNIO!

source: information
pt_pt: informações

source: Claim daily rewards to obtain and upgrade Elmir.
pt_pt: Obtém recompensas diárias para obter e melhorar Elmir.

source: Power up your team with this legendary hero and his trusty blade!
pt_pt: Reforça a tua equipa com este herói lendário e a sua fiel lâmina!

source: Visit the ancient areas of Dominion with Lara Croft and uncover its secrets!
pt_pt: Visita as áreas antigas do Domínio com Lara Croft e desvenda os seus segredos!

source: Explore
pt_pt: Explora

source: Allow
pt_pt: Permitir

source: Power up your Heroes & get a Skin+ for Julius!
pt_pt: Melhora os heróis e obtém um Visual+ para Julius!

source: - Complete tasks of this Special Event to fight dreadful Bosses!
pt_pt: - Conclui tarefas neste evento especial e enfrenta chefes aterradores!

source: Play Now
pt_pt: Jogar agora

source: A new Hero!
pt_pt: Uma nova Heroína!

source: The Dominion is celebrating St. Patrick's Day!
pt_pt: Estamos a celebrar o Dia de São Patrício no Domínio!

source: Come on in!
pt_pt: Junta-te a nós!

source: Some nice updates for the Dungeon and Titans! What’s new in the Dungeon • Removed hero rooms. • Added autocompletion for all Dungeon rooms for players with VIP level 3 or higher. • More Gold and Summoning Spheres for completing rooms. • Dungeon Coins awarded for completing Daily Quests — treat yourself to items from the Dungeon Shop! What’s new for Titans • You can now obtain stones used to improve Titan Skins in the Dungeon Shop. Time to prove yourself in a new environment!
pt_pt: Atualizações catitas para Masmorra e Titãs! Novidades da Masmorra • Removemos as salas de heróis. • Adicionámos a autoconclusão de salas da Masmorra para jogadores de nível VIP 3 ou superior. • Ouro e Esferas da Invocação adicionais ao concluir salas. • Recebes Moedas de Masmorra por concluir Missões Diárias. Gasta-as na Loja da Masmorra! Novidades dos Titãs • Podes obter pedras para melhorar Visuais de Titã na Loja da Masmorra. Mostra o que vales num cenário novo!

source: Join the Brawls and learn more about Factions!
pt_pt: Junta-te às Lutas e conhece melhor as Fações!

source: Xsolla is a cross-platform billing and monetization solution for video game developers and publishers
pt_pt: A Xsolla é uma solução de faturação e monetização multiplataformas para criadores e editoras de videojogos

source: Try out Folio in all-out brawls!
pt_pt: Experimenta Folio em grandes lutas!

source: No, thanks
pt_pt: Não, obrigado

source: CONNECT THE PIPES
pt_pt: LIGA OS CANOS

source: New event, a Hero rebalanced, and really good deals! Let's Brawl A whole new special event is here with cool rewards and unconventional rules! Test your strategy in a surprising way! Black Friday This time of year is all about great deals and discounts. Check out our unique offers and events! Magic Unleashed As his personal Black Friday deal, Kai gets a damage boost. He's ready to take on the strongest of Heroes! Also various bugs were fixed for your convenience. Have a blast, Brave Hero!
pt_pt: Novo evento, Herói ajustado e grandes ofertas! 'Bora à luta Vem aí um evento especial com recompensas espetaculares e regras caricatas! Mostra a tua capacidade tática de forma surpreendente! Black Friday Chegou a altura do ano com grandes ofertas e descontos. Espreita os nossos eventos e ofertas únicas! Hino à magia Kai recebe um reforço do dano para celebrar a sua Black Friday. Os outros heróis que se cuidem, venha quem vier! Também corrigimos vários erros. Diverte-te, herói!

source: Increase this fantastic Honor Warrior’s power!
pt_pt: Dá poder a este fantástico Guerreiro de Honra!

source: Upgrade Heroes to earn points, compete against other players, and earn prizes!
pt_pt: Melhora Heróis, ganha pontos, compete contra outros jogadores e ganha prémios!

source: Please request another recovery link. This one is incorrect or has expired.
pt_pt: Solicita outro link de recuperação, este está incorreto ou expirou.

source: Once enthralled by the Amulet of the Ancestors, Dorian broke its power over him and forced it to do his bidding — but will this last? Help the gifted Way of Chaos healer grow his powers: log into the game daily throughout October and get Soul Stones for Dorian! Raise his Blood Magic powers to a new level and make the enemy tremble with terror!
pt_pt: Outrora encantado pelo Amuleto dos Ancestrais, Dorian estilhaçou o poder que o controlava e obrigava a cumprir ordens. Será para sempre? Ajuda o dotado curandeiro do Caminho do Caos a aumentar os seus poderes. Inicia sessão todos os dias ao longo de outubro e obtém pedras anímicas para Dorian! Aumenta os seus poderes de Magia de Sangue a novos níveis e faz o inimigo tremer de medo!

source: ● 8 game modes
pt_pt: ● 8 modos de jogo

source: It’s the Beach Season!
pt_pt: É a Temporada de Praia!

source: Join the anniversary festivities in Strongford!
pt_pt: Vem celebrar o aniversário em Strongford!

source: Brawls are here with a brand new system!
pt_pt: As Lutas incluem um novo sistema!

source: All heroes are now assigned to Factions, it's time to rediscover their power!
pt_pt: Todos os heróis fazem parte de Fações, redescobre o seu poder!

source: Summon and upgrade Rigel, the new Light Titan!
pt_pt: Invoca e melhora Rigel, o novo Titã de Luz!

source: Mojo’s Brawls in the Dominion!
pt_pt: Brigas do Mojo no Domínio!

source: The Titans join the festivities in the Dominion!
pt_pt: Os Titãs juntam-se às festividades no Domínio!

source: Complete quests, upgrade your team, and dress up your Marksman Titans!
pt_pt: Conclui missões, melhora a tua equipa e veste os teus Titãs Atiradores!

source: Play now
pt_pt: Joga

source: Hero Wars celebrates its 6th anniversary!
pt_pt: Hero Wars comemora o seu sexto aniversário!

source: With exclusive events, rewards and experiences, there's always new adventures in Hero Wars
pt_pt: Há sempre novas aventuras em Hero Wars, repletas de eventos e recompensas exclusivas

source: Full Moon in Dominion
pt_pt: Lua Cheia no Domínio

source: Help the tomb raider uncover demonic secrets!
pt_pt: Ajuda-a a desvendar segredos demoníacos!

source: Currency setup
pt_pt: Configuração de moeda

source: Power up your Guardians with new Thunder Skins and get a Skin+ for Astaroth!
pt_pt: Melhora os teus Guardiões com Visuais Trovão e obtém um Visual+ para Astaroth!

source: RULE THE WORLD
pt_pt: DOMINAR O MUNDO

source: or
pt_pt: ou

source: The new year brings new beginnings!
pt_pt: O ano novo traz novidades!

source: Factions We're introducing Factions to add engaging new hero interactions.
pt_pt: Fações Apresentamos Fações cheias de divertidas interações entre heróis.

source: Faction Brawls Time to test your mettle after the division!
pt_pt: Lutas de Fação Mostra o que vales após a divisão!

source: Assemble the best hero combos to unleash their power, defeat your opponents, and receive those sweet rewards!
pt_pt: Faz os melhores combos de heróis, mostra o seu poder, derrota adversários e recebe recompensas incríveis!

source: Global Guild Championship The Cross-Server Guild Tournament has now been replaced with the Global Championship.
pt_pt: Campeonato de Guilda Global O Torneio de Guilda Global foi substituído por um Campeonato Global.

source: Participate for great rewards, such as guild flag frames!
pt_pt: Obtém recompensas como molduras de bandeira de guilda!

source: The Dominion is in for an exciting winter!
pt_pt: O Domínio vai ter um inverno bem empolgante!

source: SAVE HIM
pt_pt: SALVA-O

source: Guild Shop Updates!
pt_pt: Atualizações da Loja da Guilda!

source: In our ads, we attempt to capture the essence of the game, as there are far too many individual mechanics to display them all.
pt_pt: Nos nossos anúncios, tentamos capturar a essência do jogo, pois existem várias mecânicas individuais no jogo e não conseguimos mostrá-las todas.

source: We hope you give our game another chance!
pt_pt: Esperamos que dês outra oportunidade ao nosso jogo!

source: We're sure you'll find something that fits your fancy :)
pt_pt: Temos a certeza que vais encontrar qualquer coisa que te agrada :)

source: Unique chance to improve all Mystery Guardians!
pt_pt: Chance única de melhorar os Guardiões Mistério!

source: Play Online
pt_pt: Joga online

source: Thanks for your feedback, we'll consider adding this language to the game :) Stay tuned for the updates!
pt_pt: Agradecemos os teus comentários e vamos pensar em adicionar este idioma ao jogo :) Não percas nenhuma novidade!

source: Chabba, Octavia, and Ziri are dressed to impress and steal people's hearts while unique offers bloom in the Flower Shop!
pt_pt: Chabba, Octavia e Ziri vão impressionar e roubar o coração de todos! Aproveita as ofertas únicas na Loja de Flores!

source: GAME OVER
pt_pt: PERDESTE

source: Many centuries agо...
pt_pt: Há muitos séculos...

source: Repeat new password
pt_pt: Repete a nova palavra-passe

source: Welcome Brustar, one of the Dark Titans!
pt_pt: Dá as boas-vindas a Brustar, um dos Titãs da Escuridão!

source: New Character Darkness has closed in on Dominion...
pt_pt: Nova Personagem A Escuridão aproximou-se do Domínio...

source: and that's a good thing!
pt_pt: e isso acaba por ser bom!

source: Mighty Brustar is here and ready to bring the fight to your enemies!
pt_pt: Chegou o Poderoso Brustar, pronto para combater os teus inimigos!

source: Master of Shadows Get Brustar to join your ranks and test his powerful defense capabilities in Brawls.
pt_pt: Mestre das Sombras Faz com que Brustar se junte a ti e mostra as suas poderosas habilidades de defesa em Lutas.

source: Unleash the fury of shadows onto this world!
pt_pt: Liberta a fúria das sombras pelo mundo!

source: It's all made with love!
pt_pt: É só amor!

source: The Magic Grove A gardening competition for the guilds of the Dominion has begun!
pt_pt: A Clareira Mágica Já começou a competição de jardinagem para as guildas do Domínio!

source: Grow the tallest Magic Trees and earn unique rewards.
pt_pt: Obtém a Árvore Mágica mais alta e ganha recompensas únicas.

source: The Inner Fire Join Iris in the new otherworldly event!
pt_pt: O Fogo Interior Junta-te a Iris neste evento do outro mundo!

source: Complete quests to receive the sorceress and other valuable rewards!
pt_pt: Conclui missões para receber a feiticeira e outras recompensas valiosas!

source: Harness the great powers!
pt_pt: O poder está nas tuas mãos!

source: Embark on an adventure with Aidan & Kayla!
pt_pt: Parte à aventura com Aidan e Kayla!

source: Hello! Thanks for taking the time to try out Hero Wars! In the ad we intended to capture the essence of the game since it’s too diverse to put it all in one short video, and we’re sorry that as a result the game didn’t meet your expectations. Yet we hope you’ll give Hero Wars another chance - it’s really worth it!
pt_pt: Olá! Obrigado por teres experimentado o Hero Wars! No anúncio tentamos capturar a essência do jogo, mas é impossível mostrar toda a sua diversidade num pequeno vídeo. Lamentamos se o resultado não correspondeu às tuas expetativas, mas esperamos que dês uma nova oportunidade ao Hero Wars, porque vale mesmo a pena!

source: In this idle war game, you can collect heroes, unlock skills, summon enemies to defeat in battle, and play alongside friends in the PvP arena.
pt_pt: Neste jogo de guerra ocioso, podes recolher heróis, desbloquear habilidades, invocar inimigos para derrotar em combate e jogar juntamente a amigos na arena PvP.

source: Phoenix Festival in Hero Wars!
pt_pt: Festival da Fénix no Hero Wars

source: HELP YOUR TEAMMATES!
pt_pt: AJUDA OS TEUS ALIADOS!

source: A romantic event with new Hero Skins!
pt_pt: Um evento romântico com novos Visuais de Herói!

source: Mort is the embodiment of Darkness. He can turn the tide of any battle by weakening his enemies and buffing his allies.
pt_pt: Mort personifica a Escuridão e vira a maré da batalha ao enfraquecer os seus inimigos e ao reforçar os seus aliados.

source: Perfection of Darkness!
pt_pt: Perfeição da Escuridão!

source: First, you need to find all the missing fragments of the image.
pt_pt: Primeiro, tens de encontrar todos os fragmentos em falta da imagem.

source: They are somewhere around the door :) Then use those fragments to reassemble the image.
pt_pt: Estão algures perto da porta :) Depois, usa esses fragmentos para reconstruir a imagem.

source: After that, you'll be able to open the door!
pt_pt: A seguir, vais podes abrir a porta!

source: Lunar New Year in Hero Wars!
pt_pt: Ano Novo Lunar em Hero Wars!

source: A new Battle Pass, a bounty of discounts and skins, the Magic Tree guild competition, and the autumn festival await!
pt_pt: O novo Passe de Batalha, montes de visuais e descontos, a competição Árvore Mágica e o Festival de Outono esperam por ti

source: We're sorry that you encountered a game malfunction.
pt_pt: Lamentamos que tenhas encontrado um problema.

source: We are aware of this issue, but due to certain circumstances, addressing it is taking some time.
pt_pt: Estamos cientes dele, mas devido às circunstâncias, demorará algum tempo a resolver.

source: Nonetheless, we are working hard on resolving the problem, and we hope to fix it as soon as possible!
pt_pt: Contudo, estamos a aplicar todos os esforços para o solucionar, e esperamos ter boas notícias para ti em breve!

source: heal her
pt_pt: cura-a

source: Don’t miss out on an angelic Mushy and Shroom skin and the chance to earn tons of resources by completing quests!
pt_pt: Não percas um visual angélico para Mushy e Shroom e a possibilidade de ganhares montes de recursos ao concluir missões!

source: Winter has come! Each winter day in the Dominion has something exciting in store, and we're ready to shower you with gifts! New Winter Skins for Fafnir, Alvanor, and Phobos await. Make sure to upgrade Fafnir's skin even further during the special event! The other special event will introduce a new titan for you to recruit! Soon, Amon the Titan will illuminate the ever-growing Dominion with his light - don't miss out! We hope you have lots of fun this winter!
pt_pt: O inverno chegou! Cada dia de inverno no Domínio traz algo de entusiasmante. Vai haver uma chuva de prendas e novos visuais de inverno para Fafnir, Alvanor e Phobos. Não te esqueças de melhorar ainda mais o visual de Fafnir durante o evento especial! O segundo evento especial traz consigo um novo titã para recrutar! O Titã Amon está prestes a iluminar o Domínio! Não percas! Diverte-te este inverno!

source: For mobile devices, at least 2GB RAM is recommended for ideal gameplay.
pt_pt: Para dispositivos móveis, são recomendados pelo menos 2 GB de RAM para uma jogabilidade ideal.

source: A legendary tomb raider has arrived in Dominion!
pt_pt: A lendária invasora de túmulos chegou ao Domínio!

source: Finish quests and visit the event store to buy Martha Soul Stones, the Leprecat Doll, or resources at a great price!
pt_pt: Conclui missões, vai à loja do evento e compra Pedras Anímicas de Martha, a Boneca do Gnomolino ou recursos a bom preço!

source: Resend
pt_pt: Reenviar

source: An update under a lucky star! New Skins Garb Cascade and Ginger in stellar outfits and grant them cosmic power for the battle against evil! By completing event quests, you can also upgrade Ginger’s skin to give her even more otherworldly style! Bathe in the light of the stars and the glow of victories yet to come!
pt_pt: Uma atualização cheia de sorte! Novos Visuais Cascade e Ginger têm novos fatos estelares! Usa o poder do cosmos para derrotar os teus inimigos! Conclui missões para melhorar o visual de Ginger e dar-lhe ainda mais estilo! Que a luz das estrelas ilumine o teu caminho para a vitória!

source: The Empress returns!
pt_pt: A Imperatriz regressou!

source: This Month's Hero is Cornelius
pt_pt: O Herói do Mês é Cornelius

source: New Life of the Leprecats! Fluffy Little Rascals Leprecats are back in the Dominion! Complete challenges and earn Leprecoins to spend them on lots of useful resources at the purrosperous Leprecat Shop! Great Suprises Unique reward boxes that have something new in them every day! Open them and test your luck! Time to pet some Leprecats!
pt_pt: A Nova Vida dos Gnomolinos! Marotos Fofos Os Gnomolinos regressaram ao Domínio! Conclui desafios e ganha Gnomoedas que podes usar para obter toneladas de recursos úteis na absurda loja dos Gnomolinos! Grandes Surpresas Há caixas de recompensas únicas com surpresas novas todos os dias! Abre-as! Testa a tua sorte! Bora fazer umas festas aos Gnomolinos!

source: Prepare for the coming spring!
pt_pt: Prepara-te para a primavera!

source: Community rules
pt_pt: Regras da comunidade

source: Social Media
pt_pt: Redes sociais

source: Find Your Fun
pt_pt: Busca diversão

source: Winter Wonders are taking over!
pt_pt: Há Maravilhas de Inverno em todo o lado!

source: Uncover the mysteries of the new hero Amira and join our holiday activities!
pt_pt: Desvenda os segredos de Amira e participa nas festividades!

source: Parent's guide
pt_pt: Guia para os pais

source: This is a tricky one You need to move the statues into a line in the center, repeating the same order as you see on the right side.
pt_pt: Esta é complicada Tens de alinhar as estátuas ao centro pela mesma ordem que vês do teu lado direito.

source: First, tap on a statue, and then on a rail that you want to move your statue to.
pt_pt: Primeiro, toca numa estátua e depois no local para onde a queres deslocar.

source: Once you've put all the statues in the correct order, you'll be able to move on!
pt_pt: Quando as estátuas estiverem alinhadas pela ordem correta, poderás continuar!

source: Don’t worry, it’s quick and completely free!
pt_pt: Não te preocupes, é rápido e totalmente grátis!

source: It's the season of change! Spring in the Dominion Complete event quests, earn coins, and get to shopping! In the special new shop, you'll find cool frames, avatars, and a brand new Spring Isaac Skin. Don't forget about the great offers and resource sales! Guardian's Awakening What is Aurora hiding deep in her memories of the past? Find out by embarking on a new dungeon adventure! Take control of Aurora, defeat enemies, and obtain valuable treasures! Take a new look at your Heroes!
pt_pt: Estamos na estação da mudança! É Primavera no Domínio Conclui missões do evento, ganha moedas e faz compras na nova loja. Vais encontrar molduras porreiras, avatares e um novo visual primaveril para Isaac. Não percas as ofertas e as promoções de recursos! O Despertar dos Guardiões Porque se refugia Aurora nas memórias do passado? Parte à aventura numa nova masmorra e descobre! Controla Aurora, derrota inimigos e ganha tesouros preciosos! Dá um novo ar aos teus Heróis!

source: Legends Draft in the Dominion! A new tabletop game is picking up steam in the taverns of Strongford! Join in the fun, gather a team of random max level heroes, and challenge other players from around the world. The creator of this game, who requested not to be named, warns that it's extremely addictive! Rise to fame throughout the Dominion!
pt_pt: Recrutamento de Lendas no Domínio! Há um novo jogo a ganhar adeptos nas tavernas de Strongford! Participa! Cria uma equipa aleatória de heróis de nível máximo e desafia jogadores de todo o mundo. O criador do jogo (que deseja permanecer anónimo), deixa o aviso: não vais querer parar de jogar! Alcança a fama no Domínio!

source: We're expanding our horizons!
pt_pt: Expandimos os nossos horizontes!

source: Great news for Android users: Hero Wars Mobile is now available on the Huawei AppGallery.
pt_pt: Temos ótimas novidades para os utilizadores de Android: Hero Wars Mobile chegou à Huawei AppGallery.

source: The Dominion awaits new Guardians!
pt_pt: O Domínio aguarda a chegada de novos Guardiões!

source: Bonus level
pt_pt: Nível bónus

source: For two years, Cornelius Witt was presumed dead at the hands of dark mages, but the truth is that he was held captive and relentlessly tortured with horrifying spells. Unfortunately for his captors, the torment failed to break Cornelius and taught him to resist magic instead, which gave him the means to escape captivity and become a Guardian of the Dominion. With your help, Cornelius can hone his skills even further, so improve this Hero's stats all March and venture forth to crush the enemy!
pt_pt: Durante dois anos, Cornelius Witt foi dado como morto às mãos dos magos sombrios. A verdade é que era prisioneiro, tendo sido torturado com feitiços terríveis. Contudo, em vez de quebrar Cornelius, a tortura ensinou-o a resistir à magia, o que lhe deu as ferramentas necessárias para escapar e se tornar um Guardião do Domínio. Com a tua ajuda, Cornelius pode melhorar ainda mais as suas habilidades, por isso aproveita o mês de março para aumentar o poder deste herói e esmaga os teus inimigos!

source: Heroic Mini Event - East & West!
pt_pt: Mini evento Heroico - Este e Oeste!

source: Complete quests to get new Talismans for Astrid & Lucas, K'arkh, Krista, Lars, Lilith, and Ziri!
pt_pt: Conclui missões e obtém Talismãs para Astrid e Lucas, K'arkh, Krista, Lars, Lilith e Ziri!

source: Power up your Heroes!
pt_pt: Vão ser ainda mais poderosos

source: It's all in your hands!
pt_pt: Está nas tuas mãos!

source: Titan Brawls Your Titans are on a roll, ready to show what they are capable of!
pt_pt: Brigas de Titãs Os teus Titãs são imparáveis e estão prontos a mostrar o que valem!

source: Try them out at their best; gather the strongest teams, win, and claim your rewards!
pt_pt: Leva-os ao limite, reúne as equipas mais fortes, triunfa e conquista recompensas!

source: Useful Trainings Train easy, fight easy!
pt_pt: Treino útil Treina bem, combate melhor!

source: You can fight 10 battles at the same time in the new Training mode - and the interface is now even more friendly.
pt_pt: Podes fazer 10 combates ao mesmo tempo no novo modo de Treino, com uma interface ainda mais intuitiva.

source: Time to thrash some enemies!
pt_pt: Está na hora de desancar os adversários!

source: Link
pt_pt: Associar

source: The best season is underway: join the festive fun!
pt_pt: Começou a melhor temporada! Junta-te às festas!

source: Strengthen your Heroes with holiday outfits!
pt_pt: Melhoras os teus heróis com fatos festivos!

source: Show 'em who's the boss in Titan battles, check out the Light and Dark Titans, and be rewarded for your amazing skills!
pt_pt: Mostra a todos quem manda nas Batalhas de Titãs, descobre os Titãs da Escuridão e da Luz e recebe grandes recompensas!

source: Darkness Falls
pt_pt: Chega a Escuridão

source: Polish Zloty
pt_pt: Zlóti polaco

source: Octavia has lost her beauty and throne, but not her powers.
pt_pt: Octavia perdeu a beleza e trono, mas não os poderes.

source: She uses them to help her allies dodge and to reflect damage.
pt_pt: Ela usa-os para ajudar os aliados a esquivarem-se e refletir dano.

source: Love Is in the Air!
pt_pt: O amor está no ar!

source: Markus Is Back!
pt_pt: O Markus está de volta!

source: Tales of the Nightmare Valley!
pt_pt: Contos do Vale do Pesadelo!

source: and resume your game!
pt_pt: e retoma o teu jogo!

source: Hero Wars is celebrating its seventh anniversary!
pt_pt: O Hero Wars faz sete anos!
